---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexPoint
source: html/6dd3a04b-1b2e-7619-12ea-2aa0606e3010.htm
---
# IndexPoint Methods

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.